HaLoTaRiS/robot-biere-okdo/board/pin_mux.h
/* Symbols to be used with GPIO driver */
/*!
 * @brief GPIO peripheral base pointer */
#define BOARD_INITDEBUG_UARTPINS_SENSOR_2_XSHUT_GPIO GPIO
/*!
 * @brief GPIO pin mask */
#define BOARD_INITDEBUG_UARTPINS_SENSOR_2_XSHUT_GPIO_PIN_MASK (1U << 31U)
/*!
 * @brief PORT peripheral base pointer */
#define BOARD_INITDEBUG_UARTPINS_SENSOR_2_XSHUT_PORT 0U
/*!
 * @brief PORT pin number */
#define BOARD_INITDEBUG_UARTPINS_SENSOR_2_XSHUT_PIN 31U
/*!
 * @brief PORT pin mask */
#define BOARD_INITDEBUG_UARTPINS_SENSOR_2_XSHUT_PIN_MASK (1U << 31U)
/* @} */

/*! @name PIO1_1 (number 59), P17[15]/P23[3]/LSPI_HS_SSEL1
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITDEBUG_UARTPINS_SENSOR_2_INT_GPIO GPIO                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITDEBUG_UARTPINS_SENSOR_2_INT_GPIO_PIN_MASK (1U << 1U) /*!<@brief GPIO pin mask */
#define BOARD_INITDEBUG_UARTPINS_SENSOR_2_INT_PORT 1U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_INITDEBUG_UARTPINS_SENSOR_2_INT_PIN 1U                   /*!<@brief PORT pin number */
#define BOARD_INITDEBUG_UARTPINS_SENSOR_2_INT_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                                                       /* @} */

/*! @name PIO1_2 (number 61), P17[9]/P23[4]/LSPI_HS_SCK
  @{ */

/* Symbols to be used with GPIO driver */
/*!
 * @brief GPIO peripheral base pointer */
#define BOARD_INITDEBUG_UARTPINS_SENSOR_3_XSHUT_GPIO GPIO
/*!
 * @brief GPIO pin mask */
#define BOARD_INITDEBUG_UARTPINS_SENSOR_3_XSHUT_GPIO_PIN_MASK (1U << 2U)
/*!
 * @brief PORT peripheral base pointer */
#define BOARD_INITDEBUG_UARTPINS_SENSOR_3_XSHUT_PORT 1U
/*!
 * @brief PORT pin number */
#define BOARD_INITDEBUG_UARTPINS_SENSOR_3_XSHUT_PIN 2U
/*!
 * @brief PORT pin mask */
#define BOARD_INITDEBUG_UARTPINS_SENSOR_3_XSHUT_PIN_MASK (1U << 2U)
/* @} */

/*! @name PIO1_3 (number 62), P17[11]/P23[5]/LSPI_HS_MISO
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITDEBUG_UARTPINS_SENSOR_3_INT_GPIO GPIO                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITDEBUG_UARTPINS_SENSOR_3_INT_GPIO_PIN_MASK (1U << 3U) /*!<@brief GPIO pin mask */
#define BOARD_INITDEBUG_UARTPINS_SENSOR_3_INT_PORT 1U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_INITDEBUG_UARTPINS_SENSOR_3_INT_PIN 3U                   /*!<@brief PORT pin number */
#define BOARD_INITDEBUG_UARTPINS_SENSOR_3_INT_PIN_MASK (1U << 3U)      /*!<@brief PORT pin mask */
                                                                       /* @} */

/*! @name PIO1_5 (number 31), P17[17]/P24[1]/PIO1_5_GPIO_ARD
  @{ */

/* Symbols to be used with GPIO driver */
/*!
 * @brief GPIO peripheral base pointer */
#define BOARD_INITDEBUG_UARTPINS_SENSOR_4_XSHUT_GPIO GPIO
/*!
 * @brief GPIO pin mask */
#define BOARD_INITDEBUG_UARTPINS_SENSOR_4_XSHUT_GPIO_PIN_MASK (1U << 5U)
/*!
 * @brief PORT peripheral base pointer */
#define BOARD_INITDEBUG_UARTPINS_SENSOR_4_XSHUT_PORT 1U
/*!
 * @brief PORT pin number */
#define BOARD_INITDEBUG_UARTPINS_SENSOR_4_XSHUT_PIN 5U
/*!
 * @brief PORT pin mask */
#define BOARD_INITDEBUG_UARTPINS_SENSOR_4_XSHUT_PIN_MASK (1U << 5U)
/* @} */

/*! @name PIO1_8 (number 24), P17[19]/PIO1_8_GPIO_ARD
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITDEBUG_UARTPINS_SENSOR_4_INT_GPIO GPIO                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITDEBUG_UARTPINS_SENSOR_4_INT_GPIO_PIN_MASK (1U << 8U) /*!<@brief GPIO pin mask */
#define BOARD_INITDEBUG_UARTPINS_SENSOR_4_INT_PORT 1U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_INITDEBUG_UARTPINS_SENSOR_4_INT_PIN 8U                   /*!<@brief PORT pin number */
#define BOARD_INITDEBUG_UARTPINS_SENSOR_4_INT_PIN_MASK (1U << 8U)      /*!<@brief PORT pin mask */
                                                                       /* @} */

/*! @name PIO0_5 (number 88), S1/J10[1]/U3[12]/P17[8]/P7[7]/U11[4]/P0_5-ISP1
  @{ */

/* Symbols to be used with GPIO driver */
/*!
 * @brief GPIO peripheral base pointer */
#define BOARD_INITDEBUG_UARTPINS_SWITCH_BOARD_1_GPIO GPIO
/*!
 * @brief GPIO pin mask */
#define BOARD_INITDEBUG_UARTPINS_SWITCH_BOARD_1_GPIO_PIN_MASK (1U << 5U)
/*!
 * @brief PORT peripheral base pointer */
#define BOARD_INITDEBUG_UARTPINS_SWITCH_BOARD_1_PORT 0U
/*!
 * @brief PORT pin number */
#define BOARD_INITDEBUG_UARTPINS_SWITCH_BOARD_1_PIN 5U
/*!
 * @brief PORT pin mask */
#define BOARD_INITDEBUG_UARTPINS_SWITCH_BOARD_1_PIN_MASK (1U << 5U)
/* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitDEBUG_UARTPins(void); /* Function assigned for the Cortex-M33 (Core #0) */

#define IOCON_PIO_ASW_DI 0x00u        /*!<@brief Analog switch is open (disabled) */
#define IOCON_PIO_ASW_DIS_EN 0x00u    /*!<@brief Analog switch is closed (enabled), only for A0 version */
#define IOCON_PIO_ASW_EN 0x0400u      /*!<@brief Analog switch is closed (enabled) */
#define IOCON_PIO_DIGITAL_EN 0x0100u  /*!<@brief Enables digital function */
#define IOCON_PIO_FUNC6 0x06u         /*!<@brief Selects pin function 6 */
#define IOCON_PIO_INV_DI 0x00u        /*!<@brief Input function is not inverted */
#define IOCON_PIO_MODE_INACT 0x00u    /*!<@brief No addition pin function */
#define IOCON_PIO_MODE_PULLDOWN 0x10u /*!<@brief Selects pull-down function */
#define IOCON_PIO_MODE_PULLUP 0x20u   /*!<@brief Selects pull-up function */
#define IOCON_PIO_OPENDRAIN_DI 0x00u  /*!<@brief Open drain is disabled */
#define IOCON_PIO_SLEW_STANDARD 0x00u /*!<@brief Standard mode, output slew rate control is enabled */

/*! @name PIO0_11 (number 13), U14[4]/SWDCLK_TRGT
  @{ */
/*!
 * @brief PORT peripheral base pointer */
#define BOARD_INITSWD_DEBUGPINS_DEBUG_SWD_SWDCLK_PORT 0U
/*!
 * @brief PORT pin number */
#define BOARD_INITSWD_DEBUGPINS_DEBUG_SWD_SWDCLK_PIN 11U
/*!
 * @brief PORT pin mask */
#define BOARD_INITSWD_DEBUGPINS_DEBUG_SWD_SWDCLK_PIN_MASK (1U << 11U)
/* @} */

/*! @name PIO0_12 (number 12), U15[4]/D7/P7[2]/IF_SWDIO
  @{ */
/*!
 * @brief PORT peripheral base pointer */
#define BOARD_INITSWD_DEBUGPINS_DEBUG_SWD_SWDIO_PORT 0U
/*!
 * @brief PORT pin number */
#define BOARD_INITSWD_DEBUGPINS_DEBUG_SWD_SWDIO_PIN 12U
/*!
 * @brief PORT pin mask */
#define BOARD_INITSWD_DEBUGPINS_DEBUG_SWD_SWDIO_PIN_MASK (1U << 12U)
/* @} */

/*! @name PIO0_10 (number 21), U14[12]/SWO_TRGT
  @{ */
/*!
 * @brief PORT peripheral base pointer */
#define BOARD_INITSWD_DEBUGPINS_DEBUG_SWD_SWO_PORT 0U
/*!
 * @brief PORT pin number */
#define BOARD_INITSWD_DEBUGPINS_DEBUG_SWD_SWO_PIN 10U
/*!
 * @brief PORT pin mask */
#define BOARD_INITSWD_DEBUGPINS_DEBUG_SWD_SWO_PIN_MASK (1U << 10U)
/* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitSWD_DEBUGPins(void); /* Function assigned for the Cortex-M33 (Core #0) */

#define IOCON_PIO_DIGITAL_EN 0x0100u  /*!<@brief Enables digital function */
#define IOCON_PIO_FUNC4 0x04u         /*!<@brief Selects pin function 4 */
#define IOCON_PIO_FUNC7 0x07u         /*!<@brief Selects pin function 7 */
#define IOCON_PIO_INV_DI 0x00u        /*!<@brief Input function is not inverted */
#define IOCON_PIO_MODE_INACT 0x00u    /*!<@brief No addition pin function */
#define IOCON_PIO_MODE_PULLUP 0x20u   /*!<@brief Selects pull-up function */
#define IOCON_PIO_OPENDRAIN_DI 0x00u  /*!<@brief Open drain is disabled */
#define IOCON_PIO_SLEW_STANDARD 0x00u /*!<@brief Standard mode, output slew rate control is enabled */

